In [1]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

'Connected: None@factbook.db'

In [6]:
%%sql
SELECT *
  FROM facts
 LIMIT 5;

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

In [7]:
%%sql
SELECT MIN(population), Max(population),Min(population_growth),Max(population_growth)
from facts

Done.

[(0, 7256490011, 0.0, 4.02)]

In [11]:
%%sql
SELECT *
from facts
where population == (SELECT MIN(population)
                        FROM facts
                     );

Done.

[(250, 'ay', 'Antarctica', None, 280000, None, 0, None, None, None, None)]

In [12]:
%%sql
SELECT *
from facts
where population == (SELECT MAX(population)
                        FROM facts
                     );

Done.

[(261, 'xx', 'World', None, None, None, 7256490011, 1.08, 18.6, 7.8, None)]

In [18]:
%%sql
SELECT MIN(population), Max(population),Min(population_growth),Max(population_growth)
from facts
where name <> 'World';

Done.

[(0, 1367485388, 0.0, 4.02)]

In [20]:
%%sql
SELECT AVG(population) AS avg_population, AVG(area) AS avg_area
  FROM facts
 WHERE name <> 'World';

Done.

[(32242666.56846473, 555093.546184739)]

In [23]:
%%sql
Select name
from facts
where population > (SELECT AVG(population)
  FROM facts
 WHERE name <> 'World')  
And area < (SELECT AVG(area)
                 FROM facts
                WHERE name <> 'World')

Done.

[('Bangladesh',),
 ('Germany',),
 ('Iraq',),
 ('Italy',),
 ('Japan',),
 ('Korea, South',),
 ('Morocco',),
 ('Philippines',),
 ('Poland',),
 ('Spain',),
 ('Thailand',),
 ('Uganda',),
 ('United Kingdom',),
 ('Vietnam',)]